; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-6-3)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p0-1 - location
	p0-2 - location
	p0-3 - location
	p1-2 - location
	p2-4 - location
	p3-0 - location
	p3-2 - location
	p3-5 - location
	p3-6 - location
	p5-0 - location
	p5-1 - location
	p5-4 - location
	p6-2 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s1)
	(at driver3 s6)
	(at driver4 s3)
	(at truck1 s3)
	(empty truck1)
	(at truck2 s1)
	(empty truck2)
	(at truck3 s0)
	(empty truck3)
	(at truck4 s2)
	(empty truck4)
	(at truck5 s0)
	(empty truck5)
	(at truck6 s6)
	(empty truck6)
	(at package1 s1)
	(at package2 s5)
	(at package3 s5)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 95)
	(= (time-to-walk p0-1 s0) 95)
	(= (time-to-walk s1 p0-1) 80)
	(= (time-to-walk p0-1 s1) 80)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 54)
	(= (time-to-walk p0-2 s0) 54)
	(= (time-to-walk s2 p0-2) 36)
	(= (time-to-walk p0-2 s2) 36)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(= (time-to-walk s0 p0-3) 25)
	(= (time-to-walk p0-3 s0) 25)
	(= (time-to-walk s3 p0-3) 52)
	(= (time-to-walk p0-3 s3) 52)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 45)
	(= (time-to-walk p1-2 s1) 45)
	(= (time-to-walk s2 p1-2) 53)
	(= (time-to-walk p1-2 s2) 53)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(= (time-to-walk s2 p2-4) 37)
	(= (time-to-walk p2-4 s2) 37)
	(= (time-to-walk s4 p2-4) 68)
	(= (time-to-walk p2-4 s4) 68)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(= (time-to-walk s3 p3-2) 60)
	(= (time-to-walk p3-2 s3) 60)
	(= (time-to-walk s2 p3-2) 13)
	(= (time-to-walk p3-2 s2) 13)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(= (time-to-walk s3 p3-5) 24)
	(= (time-to-walk p3-5 s3) 24)
	(= (time-to-walk s5 p3-5) 96)
	(= (time-to-walk p3-5 s5) 96)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(= (time-to-walk s3 p3-6) 68)
	(= (time-to-walk p3-6 s3) 68)
	(= (time-to-walk s6 p3-6) 38)
	(= (time-to-walk p3-6 s6) 38)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(= (time-to-walk s5 p5-0) 2)
	(= (time-to-walk p5-0 s5) 2)
	(= (time-to-walk s0 p5-0) 9)
	(= (time-to-walk p5-0 s0) 9)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(= (time-to-walk s5 p5-1) 90)
	(= (time-to-walk p5-1 s5) 90)
	(= (time-to-walk s1 p5-1) 100)
	(= (time-to-walk p5-1 s1) 100)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(= (time-to-walk s5 p5-4) 100)
	(= (time-to-walk p5-4 s5) 100)
	(= (time-to-walk s4 p5-4) 27)
	(= (time-to-walk p5-4 s4) 27)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(= (time-to-walk s6 p6-2) 20)
	(= (time-to-walk p6-2 s6) 20)
	(= (time-to-walk s2 p6-2) 15)
	(= (time-to-walk p6-2 s2) 15)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 31)
	(= (time-to-drive s3 s1) 31)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 97)
	(= (time-to-drive s4 s1) 97)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 57)
	(= (time-to-drive s5 s1) 57)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 16)
	(= (time-to-drive s0 s2) 16)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 68)
	(= (time-to-drive s5 s2) 68)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 85)
	(= (time-to-drive s2 s3) 85)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 26)
	(= (time-to-drive s0 s4) 26)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 63)
	(= (time-to-drive s3 s4) 63)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 65)
	(= (time-to-drive s6 s4) 65)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 79)
	(= (time-to-drive s3 s5) 79)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 99)
	(= (time-to-drive s6 s5) 99)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 89)
	(= (time-to-drive s0 s6) 89)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 31)
	(= (time-to-drive s1 s6) 31)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 43)
	(= (time-to-drive s2 s6) 43)
	(link s6 s3)
	(link s3 s6)
	(= (time-to-drive s6 s3) 41)
	(= (time-to-drive s3 s6) 41)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s4)
	(at driver2 s5)
	(at driver4 s3)
	(at truck3 s5)
	(at truck5 s2)
	(at truck6 s6)
	(at package2 s2)
	(at package3 s1)
	))

(:metric minimize (+ (+ (* 3  (total-time)) (* 1  (driven))) (* 1  (walked))))

)

; plan
1. (board-truck driver1 truck2 s1)
   deleted: (at driver1 s1) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 2 of 8
2. (walk driver2 s1 p0-1)
   deleted: (at driver2 s1)
   added: (at driver2 p0-1)
   changed: (walked) from 0 to 80
   goals met: 2 of 8
3. (walk driver2 p0-1 s0)
   deleted: (at driver2 p0-1)
   added: (at driver2 s0)
   changed: (walked) from 80 to 175
   goals met: 2 of 8
4. (board-truck driver2 truck3 s0)
   deleted: (at driver2 s0) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 2 of 8
5. (drive-truck truck2 s1 s4 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   changed: (driven) from 0 to 97
   goals met: 2 of 8
6. (disembark-truck driver1 truck2 s4)
   deleted: (driving driver1 truck2)
   added: (at driver1 s4) (empty truck2)
   goals met: 3 of 8
7. (drive-truck truck3 s0 s2 driver2)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   changed: (driven) from 97 to 113
   goals met: 3 of 8
8. (drive-truck truck3 s2 s5 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s5)
   changed: (driven) from 113 to 181
   goals met: 4 of 8
9. (load-truck package2 truck3 s5)
   deleted: (at package2 s5)
   added: (in package2 truck3)
   goals met: 4 of 8
10. (load-truck package3 truck3 s5)
   deleted: (at package3 s5)
   added: (in package3 truck3)
   goals met: 4 of 8
11. (walk driver4 s3 p0-3)
   deleted: (at driver4 s3)
   added: (at driver4 p0-3)
   changed: (walked) from 175 to 227
   goals met: 3 of 8
12. (drive-truck truck3 s5 s2 driver2)
   deleted: (at truck3 s5)
   added: (at truck3 s2)
   changed: (driven) from 181 to 249
   goals met: 2 of 8
13. (unload-truck package2 truck3 s2)
   deleted: (in package2 truck3)
   added: (at package2 s2)
   goals met: 3 of 8
14. (drive-truck truck3 s2 s5 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s5)
   changed: (driven) from 249 to 317
   goals met: 4 of 8
15. (walk driver4 p0-3 s0)
   deleted: (at driver4 p0-3)
   added: (at driver4 s0)
   changed: (walked) from 227 to 252
   goals met: 4 of 8
16. (board-truck driver4 truck5 s0)
   deleted: (at driver4 s0) (empty truck5)
   added: (driving driver4 truck5)
   goals met: 4 of 8
17. (drive-truck truck5 s0 s2 driver4)
   deleted: (at truck5 s0)
   added: (at truck5 s2)
   changed: (driven) from 317 to 333
   goals met: 5 of 8
18. (disembark-truck driver2 truck3 s5)
   deleted: (driving driver2 truck3)
   added: (at driver2 s5) (empty truck3)
   goals met: 6 of 8
19. (unload-truck package3 truck3 s5)
   deleted: (in package3 truck3)
   added: (at package3 s5)
   goals met: 6 of 8
20. (drive-truck truck5 s2 s5 driver4)
   deleted: (at truck5 s2)
   added: (at truck5 s5)
   changed: (driven) from 333 to 401
   goals met: 5 of 8
21. (load-truck package3 truck5 s5)
   deleted: (at package3 s5)
   added: (in package3 truck5)
   goals met: 5 of 8
22. (drive-truck truck5 s5 s3 driver4)
   deleted: (at truck5 s5)
   added: (at truck5 s3)
   changed: (driven) from 401 to 480
   goals met: 5 of 8
23. (disembark-truck driver4 truck5 s3)
   deleted: (driving driver4 truck5)
   added: (at driver4 s3) (empty truck5)
   goals met: 6 of 8
24. (unload-truck package3 truck5 s3)
   deleted: (in package3 truck5)
   added: (at package3 s3)
   goals met: 6 of 8
25. (load-truck package3 truck1 s3)
   deleted: (at package3 s3)
   added: (in package3 truck1)
   goals met: 6 of 8
26. (board-truck driver4 truck1 s3)
   deleted: (at driver4 s3) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 5 of 8
27. (drive-truck truck1 s3 s1 driver4)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   changed: (driven) from 480 to 511
   goals met: 5 of 8
28. (unload-truck package3 truck1 s1)
   deleted: (in package3 truck1)
   added: (at package3 s1)
   goals met: 6 of 8
29. (walk driver3 s6 p3-6)
   deleted: (at driver3 s6)
   added: (at driver3 p3-6)
   changed: (walked) from 252 to 290
   goals met: 6 of 8
30. (walk driver3 p3-6 s3)
   deleted: (at driver3 p3-6)
   added: (at driver3 s3)
   changed: (walked) from 290 to 358
   goals met: 6 of 8
31. (board-truck driver3 truck5 s3)
   deleted: (at driver3 s3) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 6 of 8
32. (drive-truck truck5 s3 s2 driver3)
   deleted: (at truck5 s3)
   added: (at truck5 s2)
   changed: (driven) from 511 to 596
   goals met: 7 of 8
33. (drive-truck truck1 s1 s3 driver4)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   changed: (driven) from 596 to 627
   goals met: 7 of 8
34. (disembark-truck driver4 truck1 s3)
   deleted: (driving driver4 truck1)
   added: (at driver4 s3) (empty truck1)
   goals met: 8 of 8
